poems.2024-02-29.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-02-29 Thu 20:58 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title><i>Incomplete</i> A spaceman came travelling&#x2026;</title>
<meta name="generator" content="Org mode" />
<meta name='viewport' content='width=device-width, initial-scale=1'>
<link rel='stylesheet' href='./css/tufte.css' />
<link rel='stylesheet' href='./css/header.css' />
<!-- Google tag (gtag.js) -->
</head>
<body>
<div id="preamble" class="status">
<div class="banner">
  <div id="l_app" style="float:left"></div>
  <a id="myname" href="/">Tomaz Geddes de Almeida</a>
  <div id="r_app" style="float:left"></div>
  
  <hr/>
  <nav>
    <p>
      <a href="/">Home</a>
      <a href="/about.html">About</a>
      <a href="/blog-index.html">Writing</a>
      <a href="https://github.com/tomazgda/">Github</a>
    </p>
  </nav>
</div>

<script>
  var l_app = Elm.Cube.init({
      node: document.getElementById('l_app')
  });
  var r_app = Elm.Cube.init({
      node: document.getElementById('r_app')
  });
</script>
</div>
<div id="content">
<h1 class="title"><i>Incomplete</i> A spaceman came travelling&#x2026;</h1>
<p class="subtitle">2024-02-29</p>

<blockquote>
<p>
I’ve got some idea where I want this to go. Not enough though to make it fun to write without the kind of thinking you do when you’re stuck and on a deadline. I’m not on a deadline; I do not mind when this is done. So, until I’m siezed by intrigue, this will stay here incomplete.
</p>
</blockquote>

<p class="verse">
A spaceman came travelling, some hero of a world bygone.<br />
The flash dazed me from my home; I followed its path along<br />
the pleated streak of spectral fire that announced his rite on earth.<br />
As he emerged, bewildering me, in a starless night I searched.<br />
<br />
Buried in his destructed craft, illuminated by light I shone,<br />
leapt from debris, he siezed my torch. We jostled before it tripped.<br />
I was struck scared, cursered under my breath but settled me did his:<br />
A friendly heat in the dark: offerings of amnesty.<br />
<br />
A spaceman came travelling, of a world beheld by death.<br />
I craned my neck to inspect him as moonlight bloomed his breath.<br />
Hunger had made his body frail, I saw he needed rest.<br />
His desperation graced me; I took his weight and left.<br />
</p>
</div>
<div id="postamble" class="status">
<hr />

Bring back the blogosphere!
</div>
</body>
</html>
